#ifndef TEXTURES_H
#define TEXTURES_H

#include <PR/ultratypes.h>

/**
 * @brief struct for a texture use in menu mainly
 *
 */
typedef struct {
    /* 0x00 */ s16 type;
    /* 0x02 */ s16 unused1;
    /* 0x04 */ u64* textureData; // This should be interpreted as a segmented address
    /* 0x08 */ u16 width;
    /* 0x0A */ u16 height;
    /* 0x0C */ u16 dX;
    /* 0x0E */ u16 dY;
    /* 0x10 */ u16 size; // This size is NOT equal to width*height. Its likely the size of the compressed texture
    /* 0x12 */ s16 unused2;
} MenuTexture; // size = 0x14

/**
 * @brief struct for an animation
 *
 */
typedef struct {
    /* 0x00 */ MenuTexture* mk64Texture; // This should be interpreted as a segmented address
    /* 0x04 */ s32 frame_length;
} MkAnimation; // size = 0x8

extern MenuTexture D_02000000[2];
extern MenuTexture D_02000028[2];
extern MenuTexture D_02000050[2];
extern MenuTexture D_02000078[2];
extern MenuTexture D_020000A0[2];
extern MenuTexture D_020000C8[2];
extern MenuTexture D_020000F0[2];
extern MenuTexture D_02000118[2];
extern MenuTexture D_02000140[2];
extern MenuTexture D_02000168[2];
extern MenuTexture D_02000190[2];
extern MenuTexture D_020001B8[2];
extern MenuTexture D_020001E0[2];
extern MenuTexture D_02000208[2];
extern MenuTexture D_02000230[2];
extern MenuTexture D_02000258[2];
extern MenuTexture D_02000280[2];
extern MenuTexture D_020002A8[2];
extern MenuTexture D_020002D0[2];
extern MenuTexture D_020002F8[2];
extern MenuTexture D_02000320[2];
extern MenuTexture D_02000348[2];
extern MenuTexture D_02000370[2];
extern MenuTexture D_02000398[2];
extern MenuTexture D_020003C0[2];
extern MenuTexture D_020003E8[2];
extern MenuTexture D_02000410[2];
